CSI API ETABS v1
cLinkObj.Count Method
 Retrieves the count of the link objects in the model.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int Count()
Function Count As Integer
Dim instance As cLinkObj
Dim returnValue As Integer
returnValue = instance.Count()
int Count()
abstract Count : unit -> int
Return Value
Type: Int32
returns a count of the link objects in the model.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Name1 As String
       Dim Name2 As String
       Dim Count as Integer
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add link object by coordinates
       ret = SapModel.LinkObj.AddByCoord(-288, 0, 288, 0, 0, 0, Name1, True)
       ret = SapModel.LinkObj.AddByCoord(-288, 0, 0, 0, 0, 144, Name2)
   'refresh view
       ret = SapModel.View.RefreshView
   'get number of link objects
       Count = SapModel.LinkObj.Count
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cLinkObj Interface
ETABSv1 Namespace